Repository: yupay-dev/yupay
Catalog: src/yupay/locales/*/LC_MESSAGES/messages.po
Languages: es

source: [bold red]Configuration Error:[/bold red] {e}
es: [bold red]Error de configuración:[/bold red] {e}

source: [yellow]Analyzing resources and estimating volume...[/yellow]
es: [yellow]Analizando recursos y estimando volumen...[/yellow]

source: [green]✔ Estimation Approved:[/green] {days} days | ~{rows:,} rows | ~{size:.2f} GB
es: [green]✔ Estimación Aprobada:[/green] {days} días | ~{rows:,} filas | ~{size:.2f} GB

source: [bold red]⛔ BLOCKED BY SAFETY GUARD:[/bold red] {e}
es: [bold red]⛔ BLOQUEADO POR SEGURIDAD:[/bold red] {e}

source: [dim]Initial RAM Load: {sys:.1f}% | Budget assigned: {budget:.2f} GB[/dim]
es: [dim]Carga Inicial de RAM: {sys:.1f}% | Presupuesto: {budget:.2f} GB[/dim]

source: [red]Format Error:[/red] {e}
es: [red]Error de formato:[/red] {e}

source: [bold green]Starting Temporal Engine for:[/bold green] [bold]{domain}[/bold]
es: [bold green]Iniciando Motor Temporal para:[/bold green] [bold]{domain}[/bold]

source: 📂 Output: [blue]{path}[/blue]
es: 📂 Salida: [blue]{path}[/blue]

source: [bold green]Simulating transactions...[/bold green]
es: [bold green]Simulando transacciones...[/bold green]

source: [red]Domain '{domain}' not registered or not implemented.[/red]
es: [red]Dominio '{domain}' no registrado o no implementado.[/red]

source: Generation Summary
es: Resumen de Generación

source: Table
es: Tabla

source: Rows
es: Filas

source: File
es: Archivo

source: ✅ Process completed successfully. Path: {path} [dim]Peak RAM: Yupay {peak_gb:.2f} GB | System {peak_sys:.1f}%[/dim]
es: ✅ Proceso completado exitosamente. Ruta: {path} [dim]Peak RAM: Yupay {peak_gb:.2f} GB | Sistema {peak_sys:.1f}%[/dim]

source: [yellow]No datasets found in ./data[/yellow]
es: [yellow]No se encontraron datasets en ./data[/yellow]

source: Available Datasets
es: Datasets Disponibles

source: Domain
es: Dominio

source: Size
es: Tamaño

source: Date
es: Fecha

source: [yellow]Specify --domain [name] or --all[/yellow]
es: [yellow]Especifique --domain [nombre] o --all[/yellow]

source: [yellow]Nothing to delete.[/yellow]
es: [yellow]Nada que eliminar.[/yellow]

source: [bold red]Deleting {count} folders (Runs).[/bold red]
es: [bold red]Se eliminarán {count} carpetas (Runs).[/bold red]

source: Are you sure?
es: ¿Está seguro?

source: [green]Deleted {count} folders.[/green]
es: [green]Se eliminaron {count} carpetas.[/green]
